#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: renovate[bot], Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113602112892]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113602112903]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113602112893]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113602112901]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113602112902]
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113602112900]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113602112899]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113602112894]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113602112909]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113602112904]
data.sakuracloud_archive.ubuntu_archive: Read complete after 2s [id=113601947038]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113602112896]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113602112918]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113602112917]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113602112910]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113602112913]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113602112895]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113602112907]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113602112912]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113602112915]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113602112908]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113602112898]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113602112911]
sakuracloud_vpc_router.k8s_internal_router: Refreshing state... [id=113602112927]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113602112941]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113602112939]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113602112940]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113602112943]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113602112942]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113602112945]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113602112944]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113602112965]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113602112970]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113602112964]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113602112974]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602112918" -> (known after apply)
        name                 = "k8s-dev-control-plane-1"
      ~ server_id            = "113602112974" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602112910" -> (known after apply)
        name                 = "k8s-dev-control-plane-2"
      ~ server_id            = "113602112970" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602112917" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      ~ server_id            = "113602112964" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602112915" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      ~ server_id            = "113602112941" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602112911" -> (known after apply)
        name                 = "k8s-dev-worker-node-2"
      ~ server_id            = "113602112943" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602112913" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      ~ server_id            = "113602112945" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602112908" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      ~ server_id            = "113602112942" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602112907" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      ~ server_id            = "113602112940" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602112912" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      ~ server_id            = "113602112939" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602112895" -> (known after apply)
        name                 = "k8s-dev-worker-node-7"
      ~ server_id            = "113602112965" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602112898" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      ~ server_id            = "113602112944" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602112918",
        ] -> (known after apply)
        id                = "113602112974"
        name              = "k8s-dev-control-plane-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602112910",
        ] -> (known after apply)
        id                = "113602112970"
        name              = "k8s-dev-control-plane-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602112917",
        ] -> (known after apply)
        id                = "113602112964"
        name              = "k8s-dev-control-plane-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602112915",
          - "113602112896",
        ] -> (known after apply)
        id                = "113602112941"
        name              = "k8s-dev-worker-node-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602112911",
          - "113602112899",
        ] -> (known after apply)
        id                = "113602112943"
        name              = "k8s-dev-worker-node-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602112913",
          - "113602112903",
        ] -> (known after apply)
        id                = "113602112945"
        name              = "k8s-dev-worker-node-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602112908",
          - "113602112900",
        ] -> (known after apply)
        id                = "113602112942"
        name              = "k8s-dev-worker-node-4"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602112907",
          - "113602112901",
        ] -> (known after apply)
        id                = "113602112940"
        name              = "k8s-dev-worker-node-5"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602112912",
          - "113602112909",
        ] -> (known after apply)
        id                = "113602112939"
        name              = "k8s-dev-worker-node-6"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602112895",
          - "113602112904",
        ] -> (known after apply)
        id                = "113602112965"
        name              = "k8s-dev-worker-node-7"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602112898",
          - "113602112902",
        ] -> (known after apply)
        id                = "113602112944"
        name              = "k8s-dev-worker-node-8"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 11 to add, 11 to change, 11 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>